## Plan Result (test-frontendappgateway)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.frontendappgateway.azurerm_application_gateway.ag[0]
  * module.frontendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.frontendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.frontendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw"
        name                              = "cft-aks-fe-00-perftest-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "testing"
        }
        # (7 unchanged attributes hidden)









      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/adoption-web" -> null
          - backend_address_pool_name  = "adoption-web" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/adoption-web" -> null
          - backend_http_settings_name = "adoption-web" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/adoption-web" -> null
          - http_listener_name         = "adoption-web" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/adoption-web" -> null
          - name                       = "adoption-web" -> null
          - priority                   = 270 -> null
          - rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/bar" -> null
          - backend_address_pool_name  = "bar" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/bar" -> null
          - backend_http_settings_name = "bar" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/bar" -> null
          - http_listener_name         = "bar" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/bar" -> null
          - name                       = "bar" -> null
          - priority                   = 80 -> null
          - rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/cft-api-mgmt" -> null
          - backend_address_pool_name  = "cft-api-mgmt" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/cft-api-mgmt" -> null
          - backend_http_settings_name = "cft-api-mgmt" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/cft-api-mgmt" -> null
          - http_listener_name         = "cft-api-mgmt" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/cft-api-mgmt" -> null
          - name                       = "cft-api-mgmt" -> null
          - priority                   = 160 -> null
          - rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/civil-citizen-ui" -> null
          - backend_address_pool_name  = "civil-citizen-ui" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/civil-citizen-ui" -> null
          - backend_http_settings_name = "civil-citizen-ui" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/civil-citizen-ui" -> null
          - http_listener_name         = "civil-citizen-ui" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/civil-citizen-ui" -> null
          - name                       = "civil-citizen-ui" -> null
          - priority                   = 50 -> null
          - rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/cmc" -> null
          - backend_address_pool_name  = "cmc" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/cmc" -> null
          - backend_http_settings_name = "cmc" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/cmc" -> null
          - http_listener_name         = "cmc" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/cmc" -> null
          - name                       = "cmc" -> null
          - priority                   = 350 -> null
          - rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/cmc-legal" -> null
          - backend_address_pool_name  = "cmc-legal" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/cmc-legal" -> null
          - backend_http_settings_name = "cmc-legal" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/cmc-legal" -> null
          - http_listener_name         = "cmc-legal" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/cmc-legal" -> null
          - name                       = "cmc-legal" -> null
          - priority                   = 250 -> null
          - rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/div-da" -> null
          - backend_address_pool_name  = "div-da" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/div-da" -> null
          - backend_http_settings_name = "div-da" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/div-da" -> null
          - http_listener_name         = "div-da" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/div-da" -> null
          - name                       = "div-da" -> null
          - priority                   = 70 -> null
          - rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/div-dn" -> null
          - backend_address_pool_name  = "div-dn" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/div-dn" -> null
          - backend_http_settings_name = "div-dn" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/div-dn" -> null
          - http_listener_name         = "div-dn" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/div-dn" -> null
          - name                       = "div-dn" -> null
          - priority                   = 140 -> null
          - rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/div-pfe" -> null
          - backend_address_pool_name  = "div-pfe" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/div-pfe" -> null
          - backend_http_settings_name = "div-pfe" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/div-pfe" -> null
          - http_listener_name         = "div-pfe" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/div-pfe" -> null
          - name                       = "div-pfe" -> null
          - priority                   = 230 -> null
          - rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/div-rfe" -> null
          - backend_address_pool_name  = "div-rfe" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/div-rfe" -> null
          - backend_http_settings_name = "div-rfe" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/div-rfe" -> null
          - http_listener_name         = "div-rfe" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/div-rfe" -> null
          - name                       = "div-rfe" -> null
          - priority                   = 240 -> null
          - rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/et-sya" -> null
          - backend_address_pool_name  = "et-sya" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/et-sya" -> null
          - backend_http_settings_name = "et-sya" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/et-sya" -> null
          - http_listener_name         = "et-sya" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/et-sya" -> null
          - name                       = "et-sya" -> null
          - priority                   = 100 -> null
          - rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      - request_

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

d_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "hmi-apim"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "hmi-apim"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "hmi-apim"
          + id                         = (known after apply)
          + name                       = "hmi-apim"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "ia-aip"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "ia-aip"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "ia-aip"
          + id                         = (known after apply)
          + name                       = "ia-aip"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "idam-user-dashboard"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "idam-user-dashboard"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "idam-user-dashboard"
          + id                         = (known after apply)
          + name                       = "idam-user-dashboard"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "idam-web-admin"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "idam-web-admin"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "idam-web-admin"
          + id                         = (known after apply)
          + name                       = "idam-web-admin"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "idam-web-public"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "idam-web-public"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "idam-web-public"
          + id                         = (known after apply)
          + name                       = "idam-web-public"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "lau"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "lau"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "lau"
          + id                         = (known after apply)
          + name                       = "lau"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "nfdiv"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "nfdiv"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "nfdiv"
          + id                         = (known after apply)
          + name                       = "nfdiv"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "nfdiv-apply"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "nfdiv-apply"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "nfdiv-apply"
          + id                         = (known after apply)
          + name                       = "nfdiv-apply"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "nfdiv-civil"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "nfdiv-civil"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "nfdiv-civil"
          + id                         = (known after apply)
          + name                       = "nfdiv-civil"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "paybubble"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "paybubble"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "paybubble"
          + id                         = (known after apply)
          + name                       = "paybubble"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "paymentoutcome-web"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "paymentoutcome-web"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "paymentoutcome-web"
          + id                         = (known after apply)
          + name                       = "paymentoutcome-web"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "pcq"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "pcq"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "pcq"
          + id                         = (known after apply)
          + name                       = "pcq"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "plum"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "plum"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "plum"
          + id                         = (known after apply)
          + name                       = "plum"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "privatelaw"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "privatelaw"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "privatelaw"
          + id                         = (known after apply)
          + name                       = "privatelaw"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "probate"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "probate"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "probate"
          + id                         = (known after apply)
          + name                       = "probate"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "reformscan"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "reformscan"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "reformscan"
          + id                         = (known after apply)
          + name                       = "reformscan"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "return-case-doc-ccd"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "return-case-doc-ccd"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "return-case-doc-ccd"
          + id                         = (known after apply)
          + name                       = "return-case-doc-ccd"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-cor"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-cor"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-cor"
          + id                         = (known after apply)
          + name                       = "sscs-cor"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-tribunals"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-tribunals"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-tribunals"
          + id                         = (known after apply)
          + name                       = "sscs-tribunals"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "xui-approve-org"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "xui-approve-org"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "xui-approve-org"
          + id                         = (known after apply)
          + name                       = "xui-approve-org"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "xui-manage-org"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "xui-manage-org"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "xui-manage-org"
          + id                         = (known after apply)
          + name                       = "xui-manage-org"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "xui-register-org"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "xui-register-org"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "xui-register-org"
          + id                         = (known after apply)
          + name                       = "xui-register-org"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "xui-webapp"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "xui-webapp"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "xui-webapp"
          + id                         = (known after apply)
          + name                       = "xui-webapp"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }



        # (160 unchanged blocks hidden)
    }

  # module.frontendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.frontendappgateway.azurerm_application_gateway.ag[0] has changed
  ~ resource "azurerm_application_gateway" "ag" {
      + fips_enabled                      = false
      + force_firewall_policy_association = false
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw"
        name                              = "cft-aks-fe-00-perftest-agw"
      + private_endpoint_connection       = []
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "testing"
        }
        # (4 unchanged attributes hidden)




      ~ frontend_ip_configuration {
            id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/frontendIPConfigurations/appGwPublicFrontendIp"
            name                          = "appGwPublicFrontendIp"
            # (2 unchanged attributes hidden)
        }
      ~ frontend_ip_configuration {
            id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/frontendIPConfigurations/appGwPrivateFrontendIp"
            name                          = "appGwPrivateFrontendIp"
            # (3 unchanged attributes hidden)
        }



      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/sscs-tribunals"
            name                           = "sscs-tribunals"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/sscs-cor"
            name                           = "sscs-cor"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/civil-citizen-ui"
            name                           = "civil-citizen-ui"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/cmc"
            name                           = "cmc"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/cmc-legal"
            name                           = "cmc-legal"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/gateway-ccd"
            name                           = "gateway-ccd"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/return-case-doc-ccd"
            name                           = "return-case-doc-ccd"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/fact"
            name                           = "fact"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/fact-admin"
            name                           = "fact-admin"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/nfdiv"
            name                           = "nfdiv"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/nfdiv-apply"
            name                           = "nfdiv-apply"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/nfdiv-civil"
            name                           = "nfdiv-civil"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/idam-web-public"
            name                           = "idam-web-public"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/probate"
            name                           = "probate"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/pcq"
            name                           = "pcq"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/lau"
            name                           = "lau"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/paybubble"
            name                           = "paybubble"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/bar"
            name                           = "bar"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/fees-register"
            name                           = "fees-register"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/xui-approve-org"
            name                           = "xui-approve-org"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/xui-manage-org"
            name                           = "xui-manage-org"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/xui-register-org"
            name                           = "xui-register-org"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/ia-aip"
            name                           = "ia-aip"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/xui-webapp"
            name                           = "xui-webapp"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/idam-web-admin"
            name                           = "idam-web-admin"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/hmi-apim"
            name                           = "hmi-apim"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/reformscan"
            name                           = "reformscan"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/idam-user-dashboard"
            name                           = "idam-user-dashboard"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/div-dn"
            name                           = "div-dn"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/div-da"
            name                           = "div-da"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/div-rfe"
            name                           = "div-rfe"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/div-pfe"
            name                           = "div-pfe"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/cft-api-mgmt"
            name                           = "cft-api-mgmt"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/adoption-web"
            name                           = "adoption-web"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/privatelaw"
            name                           = "privatelaw"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/paymentoutcome-web"
            name                           = "paymentoutcome-web"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/plum"
            name                           = "plum"
            # (8 unchanged attributes hidden)
        }
      ~ http_listener {
            id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/et-sya"
            name                           = "et-sya"
            # (8 unchanged attributes hidden)
        }


      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/adoption-web"
          + backend_address_pool_name  = "adoption-web"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/adoption-web"
          + backend_http_settings_name = "adoption-web"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/adoption-web"
          + http_listener_name         = "adoption-web"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/adoption-web"
          + name                       = "adoption-web"
          + priority                   = 270
          + rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/adoption-web" -> null
          - backend_address_pool_name  = "adoption-web" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/adoption-web" -> null
          - backend_http_settings_name = "adoption-web" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/adoption-web" -> null
          - http_listener_name         = "adoption-web" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/adoption-web" -> null
          - name                       = "adoption-web" -> null
          - rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/bar"
          + backend_address_pool_name  = "bar"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/bar"
          + backend_h

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

l
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/sscs-cor"
          + backend_address_pool_name  = "sscs-cor"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/sscs-cor"
          + backend_http_settings_name = "sscs-cor"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/sscs-cor"
          + http_listener_name         = "sscs-cor"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/sscs-cor"
          + name                       = "sscs-cor"
          + priority                   = 300
          + rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/sscs-cor" -> null
          - backend_address_pool_name  = "sscs-cor" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/sscs-cor" -> null
          - backend_http_settings_name = "sscs-cor" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/sscs-cor" -> null
          - http_listener_name         = "sscs-cor" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/sscs-cor" -> null
          - name                       = "sscs-cor" -> null
          - rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/sscs-tribunals"
          + backend_address_pool_name  = "sscs-tribunals"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/sscs-tribunals"
          + backend_http_settings_name = "sscs-tribunals"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/sscs-tribunals"
          + http_listener_name         = "sscs-tribunals"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/sscs-tribunals"
          + name                       = "sscs-tribunals"
          + priority                   = 360
          + rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/sscs-tribunals" -> null
          - backend_address_pool_name  = "sscs-tribunals" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/sscs-tribunals" -> null
          - backend_http_settings_name = "sscs-tribunals" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/sscs-tribunals" -> null
          - http_listener_name         = "sscs-tribunals" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/sscs-tribunals" -> null
          - name                       = "sscs-tribunals" -> null
          - rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/xui-approve-org"
          + backend_address_pool_name  = "xui-approve-org"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/xui-approve-org"
          + backend_http_settings_name = "xui-approve-org"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/xui-approve-org"
          + http_listener_name         = "xui-approve-org"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/xui-approve-org"
          + name                       = "xui-approve-org"
          + priority                   = 210
          + rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/xui-approve-org" -> null
          - backend_address_pool_name  = "xui-approve-org" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/xui-approve-org" -> null
          - backend_http_settings_name = "xui-approve-org" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/xui-approve-org" -> null
          - http_listener_name         = "xui-approve-org" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/xui-approve-org" -> null
          - name                       = "xui-approve-org" -> null
          - rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/xui-manage-org"
          + backend_address_pool_name  = "xui-manage-org"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/xui-manage-org"
          + backend_http_settings_name = "xui-manage-org"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/xui-manage-org"
          + http_listener_name         = "xui-manage-org"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/xui-manage-org"
          + name                       = "xui-manage-org"
          + priority                   = 10
          + rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/xui-manage-org" -> null
          - backend_address_pool_name  = "xui-manage-org" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/xui-manage-org" -> null
          - backend_http_settings_name = "xui-manage-org" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/xui-manage-org" -> null
          - http_listener_name         = "xui-manage-org" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/xui-manage-org" -> null
          - name                       = "xui-manage-org" -> null
          - rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/xui-register-org"
          + backend_address_pool_name  = "xui-register-org"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/xui-register-org"
          + backend_http_settings_name = "xui-register-org"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/xui-register-org"
          + http_listener_name         = "xui-register-org"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/xui-register-org"
          + name                       = "xui-register-org"
          + priority                   = 220
          + rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/xui-register-org" -> null
          - backend_address_pool_name  = "xui-register-org" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/xui-register-org" -> null
          - backend_http_settings_name = "xui-register-org" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/xui-register-org" -> null
          - http_listener_name         = "xui-register-org" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/xui-register-org" -> null
          - name                       = "xui-register-org" -> null
          - rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/xui-webapp"
          + backend_address_pool_name  = "xui-webapp"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/xui-webapp"
          + backend_http_settings_name = "xui-webapp"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/xui-webapp"
          + http_listener_name         = "xui-webapp"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/xui-webapp"
          + name                       = "xui-webapp"
          + priority                   = 30
          + rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/xui-webapp" -> null
          - backend_address_pool_name  = "xui-webapp" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/xui-webapp" -> null
          - backend_http_settings_name = "xui-webapp" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/httpListeners/xui-webapp" -> null
          - http_listener_name         = "xui-webapp" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/requestRoutingRules/xui-webapp" -> null
          - name                       = "xui-webapp" -> null
          - rewrite_rule_set_id        = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }



        # (120 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":1126,"Program":"tfcmt","SHA1":"","Target":"test-frontendappgateway","Vars":{}} -->